/*
4.  Дан список Student. Для каждого спортсмена задано имя и список оценок.
    Список оценок это List<Integer>. Причем каждая оценка это число от 1 до 10,
    у каждого студента не более 10 оценок. Т.е. максимальный балл,
    который может набрать студент 100.
    Напишите программу которая формирует строку вида: Jack - 19;John -23;Kate-31 где число означает,
    сколько студент не добрал до максимального балла.
    Причем, студенты должны идти в порядке возрастания “недобора”.
*/


import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {
        new ArrayList<>(List.of(

        ));




    }
}