
/* Реализовать класс IntArrayHandler, который "управляет" массивом int.
Т.е. внутри должен быть массив int[]. Реализуйте метод add(int) который позволит добавить элемент,
метод toString(), метод sum(), который посчитает сумму элементов и метод get(int index) - который
возвращает элемент по индексу. Естественно, массив должен быть "резиновый".
Реализуйте в вашей программе возможность вводить числа с клавиатуры.
Если пользователь ввел 0 - программа завершается.
*/

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}