/* 1. Класс Account задан следующим образом: Account{String iban, Person owner}.
Допустим вам прислали Map<Person, Account> т.е. ключ владелец счета, значение счет
(в данной задаче, считаем, что одному клиенту принадлежит один счет).
Но при пересылке в map вкрались ошибки и у некоторых записей значение не соответствует ключу
(например, счет принадлежит Джеку, а лежит по ключу Ник).
Ваша задача написать метод, который скорректирует map.*/


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}