/* 2. Дан файл со строками вида: Jack; jack@mail.com;23 John; john@mail.com;28
прочитать файл, получит список Person без повторов*/


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}