/* 1. Дан список Person (String firstName, String lastName, int age).
Необходимо используя стрим реализовать метод, который вернет список String,
где в алфавитном порядке будут перечислены все  ФИО людей (в виде Иванов И.) старше 18 лет.*/


import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }

    public static List<String> fio (List<Person> list){
        List<String> result = new ArrayList<>();


        return result;
    }
}