/* 4. Дан текст (в рамках данной задачи текст не содержит знаков препинания,
слова разделены пробелом). Ваша задача написать метод,
который сформирует map<Boolean, List<String>> где ключу true соответствует список слов,
которые встретились в тексте меньше 3 раз, а ключу false список остальных слов.*/



public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}