/*
2.  Дан List<Employee>. У каждого Employee задано имя и год,
    с которого сотрудник работает в фирме. Руководство решило премировать N сотрудников,
    которые работают дольше всех.
    Напишите метод, который вернет новый List<Employee> премируемых сотрудников.
    Реализовать тесты.
    Если нет идей, подсказка на следующей странице.

*/



public class Main {
    public static void main(String[] args) {


        System.out.println("Hello world!");
    }
}