/* 3. Дан список Person, написать метод который проверит есть ли в этом списке заданный Person*/



public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}